## Staging: common
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 15 to add, 4 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                NAME                                 |
|--------|---------------------------------------------------------------------|
| add    | `aws_eip.notification-canada-ca-natgw-k8s[0]`                       |
|        | `aws_eip.notification-canada-ca-natgw-k8s[1]`                       |
|        | `aws_eip.notification-canada-ca-natgw-k8s[2]`                       |
|        | `aws_nat_gateway.notification-canada-ca-k8s[0]`                     |
|        | `aws_nat_gateway.notification-canada-ca-k8s[1]`                     |
|        | `aws_nat_gateway.notification-canada-ca-k8s[2]`                     |
|        | `aws_route_table.notification-canada-ca-private_subnet_k8s[0]`      |
|        | `aws_route_table.notification-canada-ca-private_subnet_k8s[1]`      |
|        | `aws_route_table.notification-canada-ca-private_subnet_k8s[2]`      |
|        | `aws_route_table_association.notification-canada-ca-private-k8s[0]` |
|        | `aws_route_table_association.notification-canada-ca-private-k8s[1]` |
|        | `aws_route_table_association.notification-canada-ca-private-k8s[2]` |
|        | `aws_subnet.notification-canada-ca-private-k8s[0]`                  |
|        | `aws_subnet.notification-canada-ca-private-k8s[1]`                  |
|        | `aws_subnet.notification-canada-ca-private-k8s[2]`                  |
| update | `aws_s3_bucket.athena_bucket`                                       |
|        | `aws_s3_bucket.csv_bucket`                                          |
|        | `aws_s3_bucket.document_bucket`                                     |
|        | `aws_s3_bucket.scan_files_document_bucket`                          |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_eip.notification-canada-ca-natgw-k8s[0] will be created
  + resource "aws_eip" "notification-canada-ca-natgw-k8s" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Name"       = "notification-canada-ca"
        }
      + tags_all             = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Name"       = "notification-canada-ca"
        }
      + vpc                  = true
    }

  # aws_eip.notification-canada-ca-natgw-k8s[1] will be created
  + resource "aws_eip" "notification-canada-ca-natgw-k8s" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Name"       = "notification-canada-ca"
        }
      + tags_all             = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Name"       = "notification-canada-ca"
        }
      + vpc                  = true
    }

  # aws_eip.notification-canada-ca-natgw-k8s[2] will be created
  + resource "aws_eip" "notification-canada-ca-natgw-k8s" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Name"       = "notification-canada-ca"
        }
      + tags_all             = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Name"       = "notification-canada-ca"
        }
      + vpc                  = true
    }

  # aws_nat_gateway.notification-canada-ca-k8s[0] will be created
  + resource "aws_nat_gateway" "notification-canada-ca-k8s" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = "subnet-0cecd9e634daf82d3"
      + tags                               = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Name"       = "notification-canada-ca"
        }
      + tags_all                           = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Name"       = "notification-canada-ca"
        }
    }

  # aws_nat_gateway.notification-canada-ca-k8s[1] will be created
  + resource "aws_nat_gateway" "notification-canada-ca-k8s" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = "subnet-0c7d18c0c51b28b61"
      + tags                               = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Name"       = "notification-canada-ca"
        }
      + tags_all                           = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Name"       = "notification-canada-ca"
        }
    }

  # aws_nat_gateway.notification-canada-ca-k8s[2] will be created
  + resource "aws_nat_gateway" "notification-canada-ca-k8s" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = "subnet-0c91f7c6b8211904b"
      + tags                               = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Name"       = "notification-canada-ca"
        }
      + tags_all                           = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Name"       = "notification-canada-ca"
        }
    }

  # aws_route_table.notification-canada-ca-private_subnet_k8s[0] will be created
  + resource "aws_route_table" "notification-canada-ca-private_subnet_k8s" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = (known after apply)
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Name"       = "Private Subnet Route Table 0"
        }
      + tags_all         = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Name"       = "Private Subnet Route Table 0"
        }
      + vpc_id           = "vpc-097508d1f5e243195"
    }

  # aws_route_table.notification-canada-ca-private_subnet_k8s[1] will be created
  + resource "aws_route_table" "notification-canada-ca-private_subnet_k8s" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = (known after apply)
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Name"       = "Private Subnet Route Table 1"
        }
      + tags_all         = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Name"       = "Private Subnet Route Table 1"
        }
      + vpc_id           = "vpc-097508d1f5e243195"
    }

  # aws_route_table.notification-canada-ca-private_subnet_k8s[2] will be created
  + resource "aws_route_table" "notification-canada-ca-private_subnet_k8s" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = (known after apply)
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Name"       = "Private Subnet Route Table 2"
        }
      + tags_all         = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Name"       = "Private Subnet Route Table 2"
        }
      + vpc_id           = "vpc-097508d1f5e243195"
    }

  # aws_route_table_association.notification-canada-ca-private-k8s[0] will be created
  + resource "aws_route_table_association" "notification-canada-ca-private-k8s" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.notification-canada-ca-private-k8s[1] will be created
  + resource "aws_route_table_association" "notification-canada-ca-private-k8s" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.notification-canada-ca-private-k8s[2] will be created
  + resource "aws_route_table_association" "notification-canada-ca-private-k8s" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_s3_bucket.athena_bucket will be updated in-place
  ~ resource "aws_s3_bucket" "athena_bucket" {
        id                          = "notification-canada-ca-staging-athena"
        tags                        = {
            "CostCenter" = "notification-canada-ca-staging"
        }
        # (11 unchanged attributes hidden)

      ~ logging {
          + target_prefix = "staging"
            # (1 unchanged attribute hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # aws_s3_bucket.csv_bucket will be updated in-place
  ~ resource "aws_s3_bucket" "csv_bucket" {
        id                          = "notification-canada-ca-staging-csv-upload"
        tags                        = {
            "CostCenter" = "notification-canada-ca-staging"
        }
        # (11 unchanged attributes hidden)

      ~ logging {
          + target_prefix = "staging"
            # (1 unchanged attribute hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # aws_s3_bucket.document_bucket will be updated in-place
  ~ resource "aws_s3_bucket" "document_bucket" {
        id                          = "notification-canada-ca-staging-document-download"
        tags                        = {
            "CostCenter" = "notification-canada-ca-staging"
        }
        # (11 unchanged attributes hidden)

      ~ logging {
          + target_prefix = "staging"
            # (1 unchanged attribute hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # aws_s3_bucket.scan_files_document_bucket will be updated in-place
  ~ resource "aws_s3_bucket" "scan_files_document_bucket" {
        id                          = "notification-canada-ca-staging-document-download-scan-files"
        tags                        = {
            "CostCenter" = "notification-canada-ca-staging"
        }
        # (12 unchanged attributes hidden)

      ~ logging {
          + target_prefix = "staging"
            # (1 unchanged attribute hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # aws_subnet.notification-canada-ca-private-k8s[0] will be created
  + resource "aws_subnet" "notification-canada-ca-private-k8s" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ca-central-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.32.0/19"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Access"                                                           = "private"
          + "CostCenter"                                                       = "notification-canada-ca-staging"
          + "Name"                                                             = "Private Subnet 04"
          + "karpenter.sh/discovery"                                           = "notification-canada-ca-staging-eks-cluster"
          + "kubernetes.io/cluster/notification-canada-ca-staging-eks-cluster" = "shared"
          + "kubernetes.io/role/internal-elb"                                  = "1"
        }
      + tags_all                                       = {
          + "Access"                                                           = "private"
          + "CostCenter"                                                       = "notification-canada-ca-staging"
          + "Name"                                                             = "Private Subnet 04"
          + "karpenter.sh/discovery"                                           = "notification-canada-ca-staging-eks-cluster"
          + "kubernetes.io/cluster/notification-canada-ca-staging-eks-cluster" = "shared"
          + "kubernetes.io/role/internal-elb"                                  = "1"
        }
      + vpc_id                                         = "vpc-097508d1f5e243195"
    }

  # aws_subnet.notification-canada-ca-private-k8s[1] will be created
  + resource "aws_subnet" "notification-canada-ca-private-k8s" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ca-central-1d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.64.0/19"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Access"                                                           = "private"
          + "CostCenter"                                                       = "notification-canada-ca-staging"
          + "Name"                                                             = "Private Subnet 05"
          + "karpenter.sh/discovery"                                           = "notification-canada-ca-staging-eks-cluster"
          + "kubernetes.io/cluster/notification-canada-ca-staging-eks-cluster" = "shared"
          + "kubernetes.io/role/internal-elb"                                  = "1"
        }
      + tags_all                                       = {
          + "Access"                                                           = "private"
          + "CostCenter"                                                       = "notification-canada-ca-staging"
          + "Name"                                                             = "Private Subnet 05"
          + "karpenter.sh/discovery"                                           = "notification-canada-ca-staging-eks-cluster"
          + "kubernetes.io/cluster/notification-canada-ca-staging-eks-cluster" = "shared"
          + "kubernetes.io/role/internal-elb"                                  = "1"
        }
      + vpc_id                                         = "vpc-097508d1f5e243195"
    }

  # aws_subnet.notification-canada-ca-private-k8s[2] will be created
  + resource "aws_subnet" "notification-canada-ca-private-k8s" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ca-central-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.96.0/19"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Access"                                                           = "private"
          + "CostCenter"                                                       = "notification-canada-ca-staging"
          + "Name"                                                             = "Private Subnet 06"
          + "karpenter.sh/discovery"                                           = "notification-canada-ca-staging-eks-cluster"
          + "kubernetes.io/cluster/notification-canada-ca-staging-eks-cluster" = "shared"
          + "kubernetes.io/role/internal-elb"                                  = "1"
        }
      + tags_all                                       = {
          + "Access"                                                           = "private"
          + "CostCenter"                                                       = "notification-canada-ca-staging"
          + "Name"                                                             = "Private Subnet 06"
          + "karpenter.sh/discovery"                                           = "notification-canada-ca-staging-eks-cluster"
          + "kubernetes.io/cluster/notification-canada-ca-staging-eks-cluster" = "shared"
          + "kubernetes.io/role/internal-elb"                                  = "1"
        }
      + vpc_id                                         = "vpc-097508d1f5e243195"
    }

Plan: 15 to add, 4 to change, 0 to destroy.

Changes to Outputs:
  + vpc_private_subnets_k8s                             = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]

Warning: Argument is deprecated

  with aws_s3_bucket.csv_bucket,
  on s3.tf line 5, in resource "aws_s3_bucket" "csv_bucket":
   5: resource "aws_s3_bucket" "csv_bucket" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 63 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.ad_hoc"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.build_tables"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.primary"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.support"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.aws_health[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.route53_resolver_query_log[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures_us_west_2[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_us_west_2[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.contact-3-500-error-15-minutes-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.document-download-bucket-size-warning[0]"]
WARN - plan.json -...
```

</details>
